ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Автотранспорт/УТЗ_ПЛ_Автотранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УТЗ_ПЛ_Автотранспорт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАвтотранспорта</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПутевогоЛистаПоУмолчанию</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыПутевыхЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_МоделиАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственнаяМасса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтотранспорта</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ТипыАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Топливо</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Топливо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВодителей</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОсновнойВодитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива/УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коэффициент</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_КоэффициентыРасходаТоплива</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/InformationRegisters/УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта/УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>НормаРасходаОсновная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаРасходаДополнительнаяНаПеревозку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Автотранспорт</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Автотранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Автотранспорт/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИспользоватьМаскуВвода = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьМаскуВводаПриИзменении(Элемент)
	
	Если ИспользоватьМаскуВвода Тогда 
		Элементы.ГосНомер.Маска = "@ 999 @@ 999";
	Иначе 
		Элементы.ГосНомер.Маска = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГосНомерПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеПредставленияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьТекущиеКоэффициентыРасхода(Команда)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Автотранспорт", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УТЗ_ПЛ_ЗначенияКоэффициентовРасходаТоплива.Форма.ФормаСпискаСрезПоследних"
	, ПараметрыФормы
	, ЭтотОбъект
	, УникальныйИдентификатор
	, 
	, 
	, 
	, РежимОткрытияОкнаФормы.Независимый);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВодителяОсновным(Команда)
	
	ТекДанн = Элементы.СписокВодителей.ТекущиеДанные;
	
	Для Каждого Строка Из Объект.СписокВодителей Цикл
		Строка.ЭтоОсновнойВодитель = Ложь;
	КонецЦикла;
	
	ТекДанн.ЭтоОсновнойВодитель = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНормыРасходаТоплива(Команда)
	Отбор = Новый Структура("Автотранспорт", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.УТЗ_ПЛ_НормыРасходаТопливаАвтотранспорта.Форма.ФормаСпискаСрезПоследних"
	, ПараметрыФормы
	, ЭтотОбъект
	, УникальныйИдентификатор
	, 
	, 
	, 
	, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьНаименование()
	
	МаркаМодели = МаркаМоделиАвтотранспорта(Объект.Модель);
	
	Если ЗначениеЗаполнено(Объект.ГосНомер) Тогда
		Объект.Наименование = СтрШаблон("%1 %2, г/н %3", МаркаМодели, Объект.Модель, Объект.ГосНомер);
	Иначе
		Объект.Наименование = "" + МаркаМодели + " " + Объект.Модель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДополнениеПредставления) Тогда 
		Объект.Наименование = "" + Объект.Наименование + " [" + Объект.ДополнениеПредставления + "]";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция МаркаМоделиАвтотранспорта(МодельАвтотранспорта)
	ЗначениеРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МодельАвтотранспорта, "Марка", Истина); // ссылка, поля, разрешенные
КонецФункции


#КонецОбласти
